export class EmojiProvider {

  getEmojis() {
    const EMOJIS = "😀 😁 😂 🤣 😃 😄 😅 😆 😉 😊 😋 😎 😍 😘 😗 😙 😚 🙂 🤗 🤩" +
    " 🤔 🤨 😐 😑 😶 🙄 😏 😣 😥 😮 🤐 😯 😪 😫 😴 😌 😛 😜 😝 🤤" +
    " 😒 😓 😔 😕 🙃 🤑 😲 🙁 😖 😞 😟 😤 😢 😭 😦 😧 😨 😩 🤯 😬" +
    " 😰 😱 😳 🤪 😵 😠 😡 🤬 😷 🤒 🤕 🤢 🤮 🤧 😇 🤠 🤡 🤥 🤫 🤭" +
    " 🧐 🤓 😈 👿 👹 👺 💀 👻 👽 🤖 💩 😺 😸 😹 😻 😼 😽 🙀 😿" +
    " 😾 🐱 🐱‍💻 🐱‍🐉 🐱‍👓 🐱‍🚀 🙈 🙉 🙊 🐵 🐶 🐺 🐱 🦁 🐯 🦊 🐮 🐷 🐗" +
    " 🐭 🐹 🐰 🐻 🐨 🐼 🐸 🐴 🦄" +
    " 👩 👨 🧑 👧 👦 🧒 👶 👵 👴 🧓 👸 🤴 👲 🧔 👼 🤶" +
    " 🤳 💪 👈 👉 ☝ 👆 👇 ✌ 🤞 🖖 🤘 🤙 🖐 ✋ 👌 👍 👎 ✊ 👊 🤛 🤜 🤚 👋 🤟 ✍ 👏 👐 🙌 🤲 🙏 🤝 💅 👂 👃" +
    " 🧡 💔 💕 💖 💝 💘 💌 💓 💞 💤 💥 💢 💦 💨 💫 ⛔ 🛑 📛 ❌ ⭕" +
    " 🚫 🔇 🔕 🚭 🚷 🚯 🚳 🚱 🔞 📵 ❗ ❓ 💯 🚸 🔰 🛂 🛃 🛄 🛅 ♿ 🚾 🅿 🚰 🚹 🚺 🚻 🚮" +
    " 📶 🆗 *️⃣ #️⃣ 0️⃣ 1️⃣ 2️⃣ 3️⃣ 4️⃣ 5️⃣ 6️⃣ 7️⃣ 8️⃣ 9️⃣ 🔟 💲 💱 ⏳ ⌚ ⏰ 📐 📏 📌 📋 📊 📆 📅 📂 📁 💼 📦 📧" +
    " 💵 💴 💶 💸 💷 💰 📰 📑 📜 📚 📔 📗 📘 📕 📖 📙 💡 📼 📹 📷 📺 📡 🎬 🎥 📀 💿 💾 💽 🔌 💻 🚬 📳 📲 📱 📴 📞 📟 📠 💣" +
    " ⛅ 🌜 🌈 ☔ 🏰 🐒 🕌 🕋" +
    " 🐎 🐂 🐃 🐄 🐖 🐏 🐑 🐐 🐪 🐫 🐘 🐁 🐀 🦔 🐇 🦎 🐊 🐢 🐍 🐉" +
    " 🦕 🦖 🦈 🐬 🦑 🐳 🐋 🐟 🐠 🦐 🐡 🐙 🐚 🦀 🦅 🦆 🦉 🦃 🐓 🐣" +
    " 🐤 🐥 🐦 🐧 🦇 🦋 🐌 🐛 🦗 🐜 🐝 🐞 🤺 👅 👄 🧠 👣";
    const EmojiArr = EMOJIS.split(' ');
    const groupNum = Math.ceil(EmojiArr.length / (24));
    const items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }

  getSmiles() {
    const EMOJIS = "😀 😁 😂 🤣 😃 😄 😅 😆 😉 😊 😋 😎 😍 😘 😗 😙 😚 ☺ 🙂 🤗 🤩" +
    " 🤔 🤨 😐 😑 😶 🙄 😏 😣 😥 😮 🤐 😯 😪 😫 😴 😌 😛 😜 😝 🤤 😒" +
    " 😓 😔 😕 🙃 🤑 😲 ☹ 🙁 😖 😞 😟 😤 😢 😭 😦 😧 😨 😩 🤯 😬 😰" +
    " 😱 😳 🤪 😵 😠 😡 🤬 😷 🤒 🤕 🤢 🤮 🤧 😇 🤠 🤡 🤥 🤫 🤭 🧐 🤓" +
    " 😈 👿 👹 👺 💀 ☠ 👻 👽 👾 🤖 💩 😺 😸 😹 😻 😼 😽 🙀 😿 😾 🐱‍👤" +
    " 🐱‍ 🏍 🐱‍💻 🐱‍🐉 🐱‍👓 🐱‍🚀 🙈 🙉 🙊 🐵 🐶 🐺 🐱 🦁 🐯 🦒 🦊 🐮 🐷 🐗 🐭 🐹" +
    " 🐰 🐻 🐨 🐼 🐸 🦓 🐴 🦄 🐔 🐲 🐽 🐾 🐩 🦌 🦍 🦏 🐒 🐕 🐈 🐅 🐆" +
    " 🐎 🐃 🐂 🐄 🐖 🐑 🐏 🐐 🐪 🐫 🐘 🐁 🐀 🦔 🐇 🐿 🦎 🐊 🐢 🐍 🐉" +
    " 🦕 🦖 🦈 🐬 🦑 🐳 🐋 🐟 🐠 🦐 🐡 🐙 🐚 🦀 🦅 🦆 🦉 🦃 🐓 🐣 🐤" +
    " 🐥 🐦 🐧 🕊 🦇 🦋 🐌 🐛 🦗 🐜 🐝 🐞 🦂 🕷 🕸 🤺 ⛷ 🧞‍♀️ 🧞‍♂️ 🗣 👤 👥 👁 👀 👅 👄 🧠 👣" +
    " 👫 👭 👬 💑 👩‍❤️‍👩 👨‍❤️‍👨 💏 👩‍❤️‍💋‍👩 👨‍❤️‍💋‍👨 👪 👨‍👩‍👧 👩‍👧‍👦 👩‍👦‍👦 👩‍👧‍👧 👨‍👦 👨‍👧 👨‍👧‍👦 👨‍👦‍👦 👨‍👧‍👧" +
    " 👨‍👩‍👧‍👦 👨‍👩‍👦‍👦 👨‍👩‍👧‍👧 👩‍👩‍👦 👩‍👩‍👧 👩‍👩‍👧‍👦 👩‍👩‍👦‍👦 👩‍👩‍👧‍👧 👨‍👨‍👦 👨‍👨‍👧 👨‍👨‍👧‍👦 👨‍👨‍👦‍👦 👨‍👨‍👧‍👧 👩‍👦 👩‍👧";
    const EmojiArr = EMOJIS.split(' ');
    const groupNum = Math.ceil(EmojiArr.length / (24));
    const items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }

  getFaces() {
    const EMOJIS = "👩 👨 🧑 👧 👦 🧒 👶 👵 👴 🧓 👸 🤴 👳‍♀️ 👳‍♂️ 👲 🧔 👱‍♀️ 👱‍♂️ 👼 🤶 🎅" +
    " 👮‍♀️ 👮‍♂️ 🕵️‍♀️ 🕵️‍♂️ 💂‍♀️ 💂‍♂️ 👷‍♀️ 👷‍♂️ 👩‍⚕️ 👨‍⚕️ 👩‍🎓 👨‍🎓 👩‍🏫 👨‍🏫 👩‍⚖️ 👨‍⚖️ 👩‍🌾 👨‍🌾 👩‍🍳 👨‍🍳 👩‍🔧" +
    " 👨‍🔧 👩‍🏭 👨‍🏭 👩‍💼 👨‍💼 👩‍🔬 👨‍🔬 👩‍💻 👨‍💻 👩‍🎤 👨‍🎤 👩‍🎨 👨‍🎨 👩‍✈️ 👨‍✈️ 👩‍🚀 👨‍🚀 👩‍🚒 👨‍🚒 🧕 👰" +
    " 🤵 🤱 🤰 🧙‍♀️ 🧙‍♂️ 🧚‍♀️ 🧚‍♂️ 🧛‍♀️ 🧛‍♂️ 🧜‍♀️ 🧜‍♂️ 🧝‍♀️ 🧝‍♂️ 🧟‍♀️ 🧟‍♂️ 🙍‍♀️ 🙍‍♂️ 🙎‍♀️ 🙎‍♂️ 🙅‍♀️ 🙅‍♂️" +
    " 🙆‍♀️ 🙆‍♂️ 💁‍♀️ 💁‍♂️ 🙋‍♀️ 🙋‍♂️ 🙇‍♀️ 🙇‍♂️ 🤦‍♀️ 🤦‍♂️ 🤷‍♀️ 🤷‍♂️ 💆‍♀️ 💆‍♂️ 💇‍♀️ 💇‍♂️ 🧖‍♀️ 🧖‍♂️ 🤹‍♀️ 🤹‍♂️ 🚶‍♀️" +
    " 🚶‍♂️ 🏃‍♀️ 🏃‍♂️ 💃 🕺 🧗‍♀️ 🧗‍♂️ 🧘‍♀️ 🧘‍♂️ 🛀 🛌 🕴 🏇 🏂 🏌️‍♀️ 🏌️‍♂️ 🏄‍♀️ 🏄‍♂️ 🚣‍♀️ 🚣‍♂️ 🏊‍♀️" +
    " 🏊‍♂️ 🤽‍♀️ 🤽‍♂️ 🤾‍♀️ 🤾‍♂️ ⛹️‍♀️ ⛹️‍♂️ 🏋️‍♀️ 🏋️‍♂️ 🚴‍♀️ 🚴‍♂️ 🚵‍♀️ 🚵‍♂️ 🤸‍♀️ 🤸‍♂️ 🤳" +
    " 💪 👈 👉 ☝ 👆 👇 ✌ 🤞 🖖 🤘 🤙 🖐 ✋ 👌 👍 👎 ✊ 👊 🤛 🤜 🤚 👋 🤟 ✍ 👏 👐 🙏 🙌 🤲 🤝 💅 👂 👃";
    const EmojiArr = EMOJIS.split(' ');
    const groupNum = Math.ceil(EmojiArr.length / (24));
    const items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }
  
  getBaloons() {
    const EMOJIS = "🎈 🎆 🎇 ✨ 🎉 🎊 🎃 🎄 🎋 🎍 🎎 🎏 🎐 🎑 🎀 🎁 🎗 🎞 🎟 🎫 🎠" +
    " 🎡 🎢 🎪 🎭 🎦 🖼 🎨 🎰 🛒 👓 🕶 🧣 🧤 🧥 👔 👕 👖 🧦 👗 👘 👙" + 
    " 👚 👛 👜 👝 🎒 🛍 👞 👟 👠 👡 👢 👑 🧢 ⛑ 👒 🎩 🎓 💋 💄 💍 💎" +
    " ⚽ ⚾ 🏀 🏈 🏉 🎱 🏐 🎳 🥌 ⛳ ⛸ 🎣 🎽 🛶 🎿 🛷 🏏 🏑 🏒 🏓 🏸" +
    " 🎾 🎯 🥊 🥋 🥅 🥇 🥈 🥉 🏅 🎖 🏆 🎮 🕹 🎲 🎴 🃏 🀄 ♠ ♣ ♥ ♦" +
    " 🔈 🔉 🔊 📢 📣 🔔 🎼 🎵 🎶 🎙 🎤 🎚 🎛 🎧 📯 🥁 🎷 🎸 🎹 🎺 🎻" +
    " 📻 🔒 🔓 🔏 🔐 🔑 🗝 🔨 ⛏ ⚒ 🛠 🔧 🔩 ⚙ 🗜 🛢 ⚗ 💉 💊 🔬 🔭" +
    " ⚖ 📿 🔗 ⛓ 🛡 🏹 🗡 ⚔ 🔪 🔫 💣 ☎ 📞 📟 📠 📱 📲 📳 📴 🚬 ⚰" +
    " ⚱ 🗿 🔮 🔋 🔌 💻 🖥 🖨 ⌨ 🖱 🖲 💽 💾 💿 📀 🎥 🎬 📽 📡 📺 📷" +
    " 📸 📹 📼 🔍 🔎 🕯 💡 🔦 🏮 📔 📕 📖 📗 📘 📙 📚 📓 📒 📃 📜 📄" +
    " 📑 📰 🗞 🔖 🏷 💰 💴 💵 💶 💷 💸 💳 🏧 🏧 ✉ 📧 📨 📩 📤 📥 📦 📫" +
    " 📪 📬 📭 📮 🗳 ✏ ✒ 🖋 🖊 🖌 🖍 📝 🗒 💼 📁 📂 🗂 📅 📆 🗓 📇" +
    " 📈 📉 📊 📋 📌 📍 📎 🖇 📏 📐 ✂ 🗃 🗄 🗑 ⌛ ⏳ ⌚ ⏰ ⏱ ⏲ 🕰";
    const EmojiArr = EMOJIS.split(' ');
    const groupNum = Math.ceil(EmojiArr.length / (24));
    const items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }

  getFoods() {
    const EMOJIS = "🍕 🍔 🍟 🌭 🍿 🥓 🥚 🥞 🍳 🍞 🥐 🥨 🥖 🧀 🥗 🥙 🥪 🌮 🌯 🥫 🍖 🍗 🥩 🍠 🥟 🥠 🥡 🍱" +
    " 🍘 🍙 🍚 🍛 🍜 🍣 🍤 🍥 🍢 🥘 🍲 🍝 🥣 🥧 🍦 🍧 🍨 🍩 🍪 🎂 🍰 🍫 🍬 🍭 🍡 🍮 🍯 🍼" +
    " 🥛 ☕ 🍵 🍶 🍾 🍷 🍸 🍹 🍺 🍻 🥂 🥃 🥤 🥢 🍽 🍴 🥄 🏺 🥝 🥥 🍇 🍈 🍉 🍊 🍋 🍌 🍍 🍎" +
    " 🍏 🍐 🍑 🍒 🍓 🍅 🍆 🌽 🌶 🍄 🥑 🥒 🥦 🥔 🥕 🌰 🥜 💐 🌸 🏵 🌹" +
    " 🌺 🌻 🌼 🌷 🥀 ☘ 🌱 🌲 🌳 🌴 🌵 🌾 🌿 🍀 🍁 🍂 🍃";
    const EmojiArr = EMOJIS.split(' ');
    const groupNum = Math.ceil(EmojiArr.length / (24));
    const items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }

  getCars() {
    const EMOJIS = "🚗 🚓 🚕 🚙 🚌 🚐 🚎 🚑 🚒 🚚 🚛 🚜 🚘 🚔 🚖 🚍 🚲 🛴 🛵 🏍 🏎" +
    " 🚄 🚅 🚈 🚝 🚞 🚃 🚋 🚆 🚉 🚊 🚇 🚟 🚠 🚡 🚂 ✈ 🛩 🛫 🛬 💺 🚁" +
    " 🚀 🛸 🛰 ⛵ 🚤 🛥 ⛴ 🛳 🚢 ⚓ 🚏 ⛽ 🚨 🚥 🚦 🚧 🏁 🏳 ‍🌈 🏳 🏴 🚩" +
    " 🌍 🌎 🌏 🗺 🏔 ⛰ 🌋 🗻 🛤 🏕 🏞 🛣 🏖 🏜 🏝 🏟 🏛 🏗 🏘 🏙 🏚" +
    " 🏠 🏡 ⛪ 🕋 🕌 🕍 ⛩ 🏢 🏣 🏤 🏥 🏦 🏨 🏩 🏪 🏫 🏬 🏭 🏯 🏰 💒" +
    " 🗼 🌉 🗽 🎌 🗾 ⛲ ⛺ 🌁 🌃 🌄 🌅 🌆 🌇 ♨ 🌌 💈 🛎 🚪 🛏 🛋 🚽" +
    " 🚿 🛁 ☁ ⛅ ⛈ 🌤 🌥 🌦 🌧 🌨 🌩 🌪 🌫 🌝 🌑 🌒 🌓 🌔 🌕 🌖 🌗" +
    " 🌘 🌙 🌚 🌛 🌜 ☀ 🌞 ⭐ 🌟 🌠 ☄ 🌡 🌬 🌀 🌈 🌂 ☂ ☔ ⛱ ⚡ ❄ ☃ ⛄ 🔥 💧 🌊";
    const EmojiArr = EMOJIS.split(' ');
    const groupNum = Math.ceil(EmojiArr.length / (24));
    const items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }

  getHeart() {
    const EMOJIS = "❤ 🧡 💛 💙 💚 💜 🖤 💔 ❣ 💕 💞 💓 💗 💖 💘 💝 💟 💌 💢 💥 💤" +
    " 💦 💨 💫 🕳 ☮ ✝ ☪ 🕉 ☸ ✡ 🔯 🕎 ☯ ☦ 🛐 ⛎ ♈ ♉ ♊ ♋ ♌" +
    " ♍ ♎ ♏ ♐ ♑ ♒ ♓ 🆔 ⚕ ⚛ 🈳 🈹 ☢ ☣ 🈶 🈚 🈸 🈺 🈷 ✴ 🆚" +
    " 🉑 💮 🉐 ㊙ ㊗ 🈴 🈵 🈲 🚼 🅰 🅱 🆎 🆑 🅾 🆘 ⛔ 🛑 📛 ❌ ⭕ 🚫" +
    " 🔇 🔕 🚭 🚷 🚯 🚳 🚱 🔞 📵 ❗ ❕ ❓ ❔ ‼ ⁉ 💯 🔅 🔆 🔱 ⚜ 〽" +
    " ⚠ 🚸 🔰 ♻ 🈯 ❇ 💹 ✳ ❎ ✅ 💠 🌐 Ⓜ 🈂 ➿ 🛂 🛃 🛄 🛅 ♿ 🚾" +
    " 🅿 🚰 🚹 🚺 🚻 🚮 📶 🈁 🆖 🆗 🆙 🆒 🆕 🆓 #️⃣ *️⃣ 0️⃣ 1️⃣ 2️⃣ 3️⃣ 4️⃣" +
    " 5️⃣ 6️⃣ 7️⃣ 8️⃣ 9️⃣ 🔟 🔢 ▶ ⏸ ⏯ ⏹ ⏺ ⏭ ⏮ ⏩ ⏪ 🔀 🔁 🔂 ◀ ⏫" +
    " ⏬ ⏏ ➡ ⬅ ⬆ ⬇ ↗ ↘ ↙ ↖ ↕ ↔ 🔄 ↪ ↩ ⤴ ⤵ ℹ 🔤 🔡 🔠" +
    " 🔣 🔃 🔛 🔝 🔜 ☑ 🔚 🔙 〰 ➰ ✔ 💲 💱 ➕ ➖ ✖ ➗ © ® ™ 🔘" +
    " ⚪ ⚫ 🔴 🔵 🔸 🔹 🔶 🔷 🔺 🔻 🔼 🔽 ◾ ◽ ⬛ ⬜ ◼ ◻ ▪ ▫ 🔲 🔳 💭 🗯 💬 🗨 👁‍🗨" +
    " 🕐 🕑 🕒 🕓 🕔 🕕 🕖 🕗 🕘 🕙 🕚 🕛 🕜 🕝 🕞 🕟 🕠 🕡 🕢 🕣 🕤 🕥 🕦 🕧";
    const EmojiArr = EMOJIS.split(' ');
    const groupNum = Math.ceil(EmojiArr.length / (24));
    const items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }
  
}
